zuyih/platform-ststm32/misc/svd/STM32U083.svd
Setting/clearing each bit unmasks/masks the CPU wake-up with event generation on the corresponding line.
Bits 18, 19, 22 and 26 are available only on STM32U0x3xx devices, they are reserved on STM32U031xx devices.</description>
                <bitOffset>22</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>wake-up with event generation masked</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>wake-up with event generation unmasked</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EM23</name>
                <description>CPU wake-up with event generation mask on line x (x1=1311to10)
Setting/clearing each bit unmasks/masks the CPU wake-up with event generation on the corresponding line.
Bits 18, 19, 22 and 26 are available only on STM32U0x3xx devices, they are reserved on STM32U031xx devices.</description>
                <bitOffset>23</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>wake-up with event generation masked</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>wake-up with event generation unmasked</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EM24</name>
                <description>CPU wake-up with event generation mask on line x (x1=1311to10)
Setting/clearing each bit unmasks/masks the CPU wake-up with event generation on the corresponding line.
Bits 18, 19, 22 and 26 are available only on STM32U0x3xx devices, they are reserved on STM32U031xx devices.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>wake-up with event generation masked</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>wake-up with event generation unmasked</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EM25</name>
                <description>CPU wake-up with event generation mask on line x (x1=1311to10)
Setting/clearing each bit unmasks/masks the CPU wake-up with event generation on the corresponding line.
Bits 18, 19, 22 and 26 are available only on STM32U0x3xx devices, they are reserved on STM32U031xx devices.</description>
                <bitOffset>25</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>wake-up with event generation masked</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>wake-up with event generation unmasked</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EM26</name>
                <description>CPU wake-up with event generation mask on line x (x1=1311to10)
Setting/clearing each bit unmasks/masks the CPU wake-up with event generation on the corresponding line.
Bits 18, 19, 22 and 26 are available only on STM32U0x3xx devices, they are reserved on STM32U031xx devices.</description>
                <bitOffset>26</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>wake-up with event generation masked</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>wake-up with event generation unmasked</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EM27</name>
                <description>CPU wake-up with event generation mask on line x (x1=1311to10)
Setting/clearing each bit unmasks/masks the CPU wake-up with event generation on the corresponding line.
Bits 18, 19, 22 and 26 are available only on STM32U0x3xx devices, they are reserved on STM32U031xx devices.</description>
                <bitOffset>27</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>wake-up with event generation masked</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>wake-up with event generation unmasked</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EM28</name>
                <description>CPU wake-up with event generation mask on line x (x1=1311to10)
Setting/clearing each bit unmasks/masks the CPU wake-up with event generation on the corresponding line.
Bits 18, 19, 22 and 26 are available only on STM32U0x3xx devices, they are reserved on STM32U031xx devices.</description>
                <bitOffset>28</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>wake-up with event generation masked</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>wake-up with event generation unmasked</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EM29</name>
                <description>CPU wake-up with event generation mask on line x (x1=1311to10)
Setting/clearing each bit unmasks/masks the CPU wake-up with event generation on the corresponding line.
Bits 18, 19, 22 and 26 are available only on STM32U0x3xx devices, they are reserved on STM32U031xx devices.</description>
                <bitOffset>29</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>wake-up with event generation masked</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>wake-up with event generation unmasked</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EM30</name>
                <description>CPU wake-up with event generation mask on line x (x1=1311to10)
Setting/clearing each bit unmasks/masks the CPU wake-up with event generation on the corresponding line.
Bits 18, 19, 22 and 26 are available only on STM32U0x3xx devices, they are reserved on STM32U031xx devices.</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>wake-up with event generation masked</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>wake-up with event generation unmasked</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EM31</name>
                <description>CPU wake-up with event generation mask on line x (x1=1311to10)
Setting/clearing each bit unmasks/masks the CPU wake-up with event generation on the corresponding line.
Bits 18, 19, 22 and 26 are available only on STM32U0x3xx devices, they are reserved on STM32U031xx devices.</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>wake-up with event generation masked</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>wake-up with event generation unmasked</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>EXTI_IMR2</name>
            <displayName>EXTI_IMR2</displayName>
            <description>EXTI CPU wake-up with interrupt mask register</description>
            <addressOffset>0x090</addressOffset>
            <size>0x20</size>
            <resetValue>0xFFFFFFFF</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>IM32</name>
                <description>CPU wake-up with interrupt mask on line x (x1=1371to132)
Setting/clearing this bit unmasks/masks the CPU wake-up with interrupt, by an event on the corresponding line.
Bit IM36 is available only on STM32U0x3xx devices, it is reserved on STM32U031xx devices.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>wake-up with interrupt request from Line x is masked</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>wake-up with interrupt request from Line x is unmasked</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>IM33</name>
                <description>CPU wake-up with interrupt mask on line x (x1=1371to132)
Setting/clearing this bit unmasks/masks the CPU wake-up with interrupt, by an event on the corresponding line.
Bit IM36 is available only on STM32U0x3xx devices, it is reserved on STM32U031xx devices.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>wake-up with interrupt request from Line x is masked</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>wake-up with interrupt request from Line x is unmasked</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>IM34</name>
                <description>CPU wake-up with interrupt mask on line x (x1=1371to132)
Setting/clearing this bit unmasks/masks the CPU wake-up with interrupt, by an event on the corresponding line.
Bit IM36 is available only on STM32U0x3xx devices, it is reserved on STM32U031xx devices.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>wake-up with interrupt request from Line x is masked</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>wake-up with interrupt request from Line x is unmasked</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>IM35</name>
                <description>CPU wake-up with interrupt mask on line x (x1=1371to132)
Setting/clearing this bit unmasks/masks the CPU wake-up with interrupt, by an event on the corresponding line.
Bit IM36 is available only on STM32U0x3xx devices, it is reserved on STM32U031xx devices.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>wake-up with interrupt request from Line x is masked</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>wake-up with interrupt request from Line x is unmasked</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>IM36</name>
                <description>CPU wake-up with interrupt mask on line x (x1=1371to132)
Setting/clearing this bit unmasks/masks the CPU wake-up with interrupt, by an event on the corresponding line.
Bit IM36 is available only on STM32U0x3xx devices, it is reserved on STM32U031xx devices.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>wake-up with interrupt request from Line x is masked</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>wake-up with interrupt request from Line x is unmasked</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>IM37</name>
                <description>CPU wake-up with interrupt mask on line x (x1=1371to132)
Setting/clearing this bit unmasks/masks the CPU wake-up with interrupt, by an event on the corresponding line.
Bit IM36 is available only on STM32U0x3xx devices, it is reserved on STM32U031xx devices.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>wake-up with interrupt request from Line x is masked</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>wake-up with interrupt request from Line x is unmasked</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
