zuyih/platform-ststm32/misc/svd/STM32U083.svd
          <register>
            <name>PWR_SCR</name>
            <displayName>PWR_SCR</displayName>
            <description>Power status clear register</description>
            <addressOffset>0x18</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CWUF1</name>
                <description>Clear wake-up flag 1
Setting this bit clears the WUF1 flag in the PWR_SR1 register.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>CWUF2</name>
                <description>Clear wake-up flag 2
Setting this bit clears the WUF2 flag in the PWR_SR1 register.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>CWUF3</name>
                <description>Clear wake-up flag 3
Setting this bit clears the WUF3 flag in the PWR_SR1 register.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>CWUF4</name>
                <description>Clear wake-up flag 4
Setting this bit clears the WUF4 flag in the PWR_SR1 register.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>CWUF5</name>
                <description>Clear wake-up flag 5
Setting this bit clears the WUF5 flag in the PWR_SR1 register.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>CWUF7</name>
                <description>Clear wake-up flag 7
Setting this bit clears the WUF7 flag in the PWR_SR1 register.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>CSBF</name>
                <description>Clear standby flag
Setting this bit clears the SBF flag in the PWR_SR1 register.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PWR_PUCRA</name>
            <displayName>PWR_PUCRA</displayName>
            <description>Power Port A pull-up control register</description>
            <addressOffset>0x20</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PU0</name>
                <description>Port A pull-up bit y (y1=115 to 0)
When set, this bit activates the pull-up on PA[y] when APC bit is set in PWR_CR3 register. If the corresponding PDy bit is also set, the pull-up is not activated and the pull-down is activated instead with highest priority.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PU1</name>
                <description>Port A pull-up bit y (y1=115 to 0)
When set, this bit activates the pull-up on PA[y] when APC bit is set in PWR_CR3 register. If the corresponding PDy bit is also set, the pull-up is not activated and the pull-down is activated instead with highest priority.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PU2</name>
                <description>Port A pull-up bit y (y1=115 to 0)
When set, this bit activates the pull-up on PA[y] when APC bit is set in PWR_CR3 register. If the corresponding PDy bit is also set, the pull-up is not activated and the pull-down is activated instead with highest priority.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PU3</name>
                <description>Port A pull-up bit y (y1=115 to 0)
When set, this bit activates the pull-up on PA[y] when APC bit is set in PWR_CR3 register. If the corresponding PDy bit is also set, the pull-up is not activated and the pull-down is activated instead with highest priority.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PU4</name>
                <description>Port A pull-up bit y (y1=115 to 0)
When set, this bit activates the pull-up on PA[y] when APC bit is set in PWR_CR3 register. If the corresponding PDy bit is also set, the pull-up is not activated and the pull-down is activated instead with highest priority.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PU5</name>
                <description>Port A pull-up bit y (y1=115 to 0)
When set, this bit activates the pull-up on PA[y] when APC bit is set in PWR_CR3 register. If the corresponding PDy bit is also set, the pull-up is not activated and the pull-down is activated instead with highest priority.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PU6</name>
                <description>Port A pull-up bit y (y1=115 to 0)
When set, this bit activates the pull-up on PA[y] when APC bit is set in PWR_CR3 register. If the corresponding PDy bit is also set, the pull-up is not activated and the pull-down is activated instead with highest priority.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PU7</name>
                <description>Port A pull-up bit y (y1=115 to 0)
When set, this bit activates the pull-up on PA[y] when APC bit is set in PWR_CR3 register. If the corresponding PDy bit is also set, the pull-up is not activated and the pull-down is activated instead with highest priority.</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PU8</name>
                <description>Port A pull-up bit y (y1=115 to 0)
When set, this bit activates the pull-up on PA[y] when APC bit is set in PWR_CR3 register. If the corresponding PDy bit is also set, the pull-up is not activated and the pull-down is activated instead with highest priority.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PU9</name>
                <description>Port A pull-up bit y (y1=115 to 0)
When set, this bit activates the pull-up on PA[y] when APC bit is set in PWR_CR3 register. If the corresponding PDy bit is also set, the pull-up is not activated and the pull-down is activated instead with highest priority.</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PU10</name>
                <description>Port A pull-up bit y (y1=115 to 0)
When set, this bit activates the pull-up on PA[y] when APC bit is set in PWR_CR3 register. If the corresponding PDy bit is also set, the pull-up is not activated and the pull-down is activated instead with highest priority.</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PU11</name>
                <description>Port A pull-up bit y (y1=115 to 0)
When set, this bit activates the pull-up on PA[y] when APC bit is set in PWR_CR3 register. If the corresponding PDy bit is also set, the pull-up is not activated and the pull-down is activated instead with highest priority.</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PU12</name>
                <description>Port A pull-up bit y (y1=115 to 0)
When set, this bit activates the pull-up on PA[y] when APC bit is set in PWR_CR3 register. If the corresponding PDy bit is also set, the pull-up is not activated and the pull-down is activated instead with highest priority.</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PU13</name>
                <description>Port A pull-up bit y (y1=115 to 0)
When set, this bit activates the pull-up on PA[y] when APC bit is set in PWR_CR3 register. If the corresponding PDy bit is also set, the pull-up is not activated and the pull-down is activated instead with highest priority.</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PU14</name>
                <description>Port A pull-up bit y (y1=115 to 0)
When set, this bit activates the pull-up on PA[y] when APC bit is set in PWR_CR3 register. If the corresponding PDy bit is also set, the pull-up is not activated and the pull-down is activated instead with highest priority.</description>
                <bitOffset>14</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PU15</name>
                <description>Port A pull-up bit y (y1=115 to 0)
When set, this bit activates the pull-up on PA[y] when APC bit is set in PWR_CR3 register. If the corresponding PDy bit is also set, the pull-up is not activated and the pull-down is activated instead with highest priority.</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PWR_PDCRA</name>
            <displayName>PWR_PDCRA</displayName>
            <description>Power Port A pull-down control register</description>
            <addressOffset>0x24</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PD0</name>
                <description>Port A pull-down bit y
When set, this bit activates the pull-down on PA[y] when APC bit is set in PWR_CR3 register.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PD1</name>
                <description>Port A pull-down bit y
When set, this bit activates the pull-down on PA[y] when APC bit is set in PWR_CR3 register.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PD2</name>
                <description>Port A pull-down bit y
When set, this bit activates the pull-down on PA[y] when APC bit is set in PWR_CR3 register.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PD3</name>
                <description>Port A pull-down bit y
When set, this bit activates the pull-down on PA[y] when APC bit is set in PWR_CR3 register.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PD4</name>
                <description>Port A pull-down bit y
When set, this bit activates the pull-down on PA[y] when APC bit is set in PWR_CR3 register.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PD5</name>
                <description>Port A pull-down bit y
When set, this bit activates the pull-down on PA[y] when APC bit is set in PWR_CR3 register.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PD6</name>
                <description>Port A pull-down bit y
When set, this bit activates the pull-down on PA[y] when APC bit is set in PWR_CR3 register.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PD7</name>
                <description>Port A pull-down bit y
When set, this bit activates the pull-down on PA[y] when APC bit is set in PWR_CR3 register.</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PD8</name>
                <description>Port A pull-down bit y
When set, this bit activates the pull-down on PA[y] when APC bit is set in PWR_CR3 register.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PD9</name>
                <description>Port A pull-down bit y
When set, this bit activates the pull-down on PA[y] when APC bit is set in PWR_CR3 register.</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PD10</name>
                <description>Port A pull-down bit y
When set, this bit activates the pull-down on PA[y] when APC bit is set in PWR_CR3 register.</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PD11</name>
                <description>Port A pull-down bit y
When set, this bit activates the pull-down on PA[y] when APC bit is set in PWR_CR3 register.</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PD12</name>
                <description>Port A pull-down bit y
When set, this bit activates the pull-down on PA[y] when APC bit is set in PWR_CR3 register.</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PD13</name>
                <description>Port A pull-down bit y
When set, this bit activates the pull-down on PA[y] when APC bit is set in PWR_CR3 register.</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PD14</name>
                <description>Port A pull-down bit y
When set, this bit activates the pull-down on PA[y] when APC bit is set in PWR_CR3 register.</description>
                <bitOffset>14</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PD15</name>
                <description>Port A pull-down bit y
When set, this bit activates the pull-down on PA[y] when APC bit is set in PWR_CR3 register.</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PWR_PUCRB</name>
            <displayName>PWR_PUCRB</displayName>
            <description>Power Port B pull-up control register</description>
            <addressOffset>0x28</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PU0</name>
                <description>Port B pull-up bit y
When set, this bit activates the pull-up on PB[y] when APC bit is set in PWR_CR3 register.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PU1</name>
                <description>Port B pull-up bit y
When set, this bit activates the pull-up on PB[y] when APC bit is set in PWR_CR3 register.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PU2</name>
                <description>Port B pull-up bit y
When set, this bit activates the pull-up on PB[y] when APC bit is set in PWR_CR3 register.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PU3</name>
                <description>Port B pull-up bit y
When set, this bit activates the pull-up on PB[y] when APC bit is set in PWR_CR3 register.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PU4</name>
                <description>Port B pull-up bit y
When set, this bit activates the pull-up on PB[y] when APC bit is set in PWR_CR3 register.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PU5</name>
                <description>Port B pull-up bit y
When set, this bit activates the pull-up on PB[y] when APC bit is set in PWR_CR3 register.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PU6</name>
                <description>Port B pull-up bit y
When set, this bit activates the pull-up on PB[y] when APC bit is set in PWR_CR3 register.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PU7</name>
                <description>Port B pull-up bit y
When set, this bit activates the pull-up on PB[y] when APC bit is set in PWR_CR3 register.</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PU8</name>
                <description>Port B pull-up bit y
When set, this bit activates the pull-up on PB[y] when APC bit is set in PWR_CR3 register.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PU9</name>
                <description>Port B pull-up bit y
When set, this bit activates the pull-up on PB[y] when APC bit is set in PWR_CR3 register.</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PU10</name>
                <description>Port B pull-up bit y
When set, this bit activates the pull-up on PB[y] when APC bit is set in PWR_CR3 register.</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PU11</name>
                <description>Port B pull-up bit y
When set, this bit activates the pull-up on PB[y] when APC bit is set in PWR_CR3 register.</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PU12</name>
                <description>Port B pull-up bit y
When set, this bit activates the pull-up on PB[y] when APC bit is set in PWR_CR3 register.</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PU13</name>
                <description>Port B pull-up bit y
When set, this bit activates the pull-up on PB[y] when APC bit is set in PWR_CR3 register.</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PU14</name>
                <description>Port B pull-up bit y
When set, this bit activates the pull-up on PB[y] when APC bit is set in PWR_CR3 register.</description>
                <bitOffset>14</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PU15</name>
                <description>Port B pull-up bit y
When set, this bit activates the pull-up on PB[y] when APC bit is set in PWR_CR3 register.</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
