zuyih/platform-ststm32/misc/svd/STM32U083.svd
          <register>
            <name>SPI_DR</name>
            <displayName>SPI_DR</displayName>
            <description>SPI data register</description>
            <addressOffset>0x0C</addressOffset>
            <size>16</size>
            <resetValue>0x0000</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>DR</name>
                <description>Data register
Data received or to be transmitted
The data register serves as an interface between the Rx and Tx FIFOs. When the data register is read, RxFIFO is accessed while the write to data register accesses TxFIFO (See Section133.4.9: Data transmission and reception procedures).
Note: Data is always right-aligned. Unused bits are ignored when writing to the register, and read as zero when the register is read. The Rx threshold setting must always correspond with the read access currently used.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SPI_CRCPR</name>
            <displayName>SPI_CRCPR</displayName>
            <description>SPI CRC polynomial register</description>
            <addressOffset>0x10</addressOffset>
            <size>16</size>
            <resetValue>0x0007</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>CRCPOLY</name>
                <description>CRC polynomial register
This register contains the polynomial for the CRC calculation.
The CRC polynomial (0x0007) is the reset value of this register. Another polynomial can be configured as required.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SPI_RXCRCR</name>
            <displayName>SPI_RXCRCR</displayName>
            <description>SPI Rx CRC register</description>
            <addressOffset>0x14</addressOffset>
            <size>16</size>
            <resetValue>0x0000</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>RXCRC</name>
                <description>Rx CRC register
When CRC calculation is enabled, the RXCRC[15:0] bits contain the computed CRC value of the subsequently received bytes. This register is reset when the CRCEN bit in SPI_CR1 register is written to 1. The CRC is calculated serially using the polynomial programmed in the SPI_CRCPR register. 
Only the 8 LSB bits are considered when the CRC frame format is set to be 8-bit length (CRCL bit in the SPI_CR1 is cleared). CRC calculation is done based on any CRC8 standard.
The entire 16-bits of this register are considered when a 16-bit CRC frame format is selected (CRCL bit in the SPI_CR1 register is set). CRC calculation is done based on any CRC16 standard.
Note: A read to this register when the BSY Flag is set could return an incorrect value.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SPI_TXCRCR</name>
            <displayName>SPI_TXCRCR</displayName>
            <description>SPI Tx CRC register</description>
            <addressOffset>0x18</addressOffset>
            <size>16</size>
            <resetValue>0x0000</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>TXCRC</name>
                <description>Tx CRC register
When CRC calculation is enabled, the TXCRC[7:0] bits contain the computed CRC value of the subsequently transmitted bytes. This register is reset when the CRCEN bit of SPI_CR1 is written to 1. The CRC is calculated serially using the polynomial programmed in the SPI_CRCPR register.
Only the 8 LSB bits are considered when the CRC frame format is set to be 8-bit length (CRCL bit in the SPI_CR1 is cleared). CRC calculation is done based on any CRC8 standard.
The entire 16-bits of this register are considered when a 16-bit CRC frame format is selected (CRCL bit in the SPI_CR1 register is set). CRC calculation is done based on any CRC16 standard.
Note: A read to this register when the BSY flag is set could return an incorrect value.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
        </registers>
      </peripheral>	  
	  <peripheral derivedFrom="SPI1">
        <name>SPI2</name>
        <baseAddress>0x40003800</baseAddress>
		<interrupt>
          <name>SPI2_SPI3</name>
          <description>SPI2/3 global interrupt</description>
          <value>26</value>
        </interrupt>
      </peripheral>
	  <peripheral derivedFrom="SPI1">
        <name>SPI3</name>
        <baseAddress>0x40003C00</baseAddress>
      </peripheral>
	  <peripheral>
        <name>SYSCFG</name>
        <description>SYSCFG register block</description>
		<groupName>SYSCFG</groupName>
        <baseAddress>0x40010000</baseAddress>
		<addressBlock>
          <offset>0x0</offset>
          <size>0x400</size>
          <usage>registers</usage>
        </addressBlock>
        <registers>
          <register>
            <name>SYSCFG_CFGR1</name>
            <displayName>SYSCFG_CFGR1</displayName>
            <description>SYSCFG configuration register 1</description>
            <addressOffset>0x00</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFF0</resetMask>
            <fields>
              <field>
                <name>MEM_MODE</name>
                <description>Memory mapping selection bits
These bits are set and cleared by software. They control the memory internal mapping at address 0x000010000. After reset these bits take on the value selected by the actual boot mode configuration. Refer to Section12.5: Boot configuration for more details.
X0: Main flash memory mapped at 0x000010000</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>System flash memory mapped at 0x000010000</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>Embedded SRAM mapped at 0x000010000</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PA11_RMP</name>
                <description>PA11 pin remapping
This bit is set and cleared by software. When set, it remaps the PA11 pin to operate as PA9 GPIO port, instead as PA11 GPIO port.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No remap (PA11)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Remap (PA9)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PA12_RMP</name>
                <description>PA12 pin remapping
This bit is set and cleared by software. When set, it remaps the PA12 pin to operate as PA10 GPIO port, instead as PA12 GPIO port.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No remap (PA12)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Remap (PA10)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>IR_POL</name>
                <description>IR output polarity selection</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Output of IRTIM (IR_OUT) is not inverted</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Output of IRTIM (IR_OUT) is inverted</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>IR_MOD</name>
                <description>IR Modulation Envelope signal selection
This bitfield selects the signal for IR modulation envelope:</description>
                <bitOffset>6</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>TIM16</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>USART1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>USART2</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BOOSTEN</name>
                <description>I/O analog switch voltage booster enable
This bit selects the way of supplying I/O analog switches:
When using the analog inputs , setting to 0 is recommended for high V&lt;sub&gt;DD&lt;/sub&gt;, setting to 1 for low V&lt;sub&gt;DD&lt;/sub&gt; (less than 2.4 V).</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>V&lt;sub&gt;DD&lt;/sub&gt;</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Dedicated voltage booster (supplied by V&lt;sub&gt;DD&lt;/sub&gt;)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>I2C_PB6_FMP</name>
                <description>Fast Mode Plus (FM+) enable for PB6
This bit is set and cleared by software. It enables I&lt;sup&gt;2&lt;/sup&gt;C FM+ driving capability on PB6 I/O port.
With this bit in disable state, the I&lt;sup&gt;2&lt;/sup&gt;C FM+ driving capability on this I/O port can be enabled through one of I2Cx_FMP bits. When I&lt;sup&gt;2&lt;/sup&gt;C FM+ is enabled, the speed control is ignored.
Note: This control bit is kept for legacy reasons. It is recommended to use the FMP bit of the I2Cx_CR1 register instead.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Disable</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Enable</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>I2C_PB7_FMP</name>
                <description>Fast Mode Plus (FM+) enable for PB7
This bit is set and cleared by software. It enables I&lt;sup&gt;2&lt;/sup&gt;C FM+ driving capability on PB7 I/O port.
With this bit in disable state, the I&lt;sup&gt;2&lt;/sup&gt;C FM+ driving capability on this I/O port can be enabled through one of I2Cx_FMP bits. When I&lt;sup&gt;2&lt;/sup&gt;C FM+ is enabled, the speed control is ignored.
Note: This control bit is kept for legacy reasons. It is recommended to use the FMP bit of the I2Cx_CR1 register instead.</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Disable</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Enable</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>I2C_PB8_FMP</name>
                <description>Fast Mode Plus (FM+) enable for PB8
This bit is set and cleared by software. It enables I&lt;sup&gt;2&lt;/sup&gt;C FM+ driving capability on PB8 I/O port.
With this bit in disable state, the I&lt;sup&gt;2&lt;/sup&gt;C FM+ driving capability on this I/O port can be enabled through one of I2Cx_FMP bits. When I&lt;sup&gt;2&lt;/sup&gt;C FM+ is enabled, the speed control is ignored.
Note: This control bit is kept for legacy reasons. It is recommended to use the FMP bit of the I2Cx_CR1 register instead.</description>
                <bitOffset>18</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Disable</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Enable</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>I2C_PB9_FMP</name>
                <description>Fast Mode Plus (FM+) enable for PB9
This bit is set and cleared by software. It enables I&lt;sup&gt;2&lt;/sup&gt;C FM+ driving capability on PB9 I/O port.
With this bit in disable state, the I&lt;sup&gt;2&lt;/sup&gt;C FM+ driving capability on this I/O port can be enabled through one of I2Cx_FMP bits. When I&lt;sup&gt;2&lt;/sup&gt;C FM+ is enabled, the speed control is ignored.
Note: This control bit is kept for legacy reasons. It is recommended to use the FMP bit of the I2Cx_CR1 register instead.</description>
                <bitOffset>19</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Disable</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Enable</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>I2C_PA9_FMP</name>
                <description>Fast Mode Plus (FM+) enable for PA9
This bit is set and cleared by software. It enables I&lt;sup&gt;2&lt;/sup&gt;C FM+ driving capability on PA9 I/O port.
With this bit in disable state, the I&lt;sup&gt;2&lt;/sup&gt;C FM+ driving capability on this I/O port can be enabled through one of I2Cx_FMP bits. When I&lt;sup&gt;2&lt;/sup&gt;C FM+ is enabled, the speed control is ignored.
Note: This control bit is kept for legacy reasons. It is recommended to use the FMP bit of the I2Cx_CR1 register instead.</description>
                <bitOffset>22</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Disable</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Enable</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>I2C_PA10_FMP</name>
                <description>Fast Mode Plus (FM+) enable for PA10
This bit is set and cleared by software. It enables I&lt;sup&gt;2&lt;/sup&gt;C FM+ driving capability on PA10 I/O port.
With this bit in disable state, the I&lt;sup&gt;2&lt;/sup&gt;C FM+ driving capability on this I/O port can be enabled through one of I2Cx_FMP bits. When I&lt;sup&gt;2&lt;/sup&gt;C FM+ is enabled, the speed control is ignored.
Note: This control bit is kept for legacy reasons. It is recommended to use the FMP bit of the I2Cx_CR1 register instead.</description>
                <bitOffset>23</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Disable</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Enable</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>I2C3_FMP</name>
                <description>Fast Mode Plus (FM+) enable for I2C3
This bit is set and cleared by software. It enables I&lt;sup&gt;2&lt;/sup&gt;C FM+ driving capability on I/O ports configured as I2C3 through GPIOx_AFR registers.
With this bit in disable state, the I&lt;sup&gt;2&lt;/sup&gt;C FM+ driving capability on I/O ports configured as I2C3 can be enabled through their corresponding I2Cx_FMP bit. When I&lt;sup&gt;2&lt;/sup&gt;C FM+ is enabled, the speed control is ignored.
Note: This control bit is kept for legacy reasons. It is recommended to use the FMP bit of the I2Cx_CR1 register instead.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Disable</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Enable</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
