zuyih/platform-ststm32/misc/svd/STM32U083.svd
          <register>
            <name>SYSCFG_ITLINE25</name>
            <displayName>SYSCFG_ITLINE25</displayName>
            <description>SYSCFG interrupt line 25 status register</description>
            <addressOffset>0xE4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SPI1</name>
                <description>SPI1 interrupt request pending</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSCFG_ITLINE26</name>
            <displayName>SYSCFG_ITLINE26</displayName>
            <description>SYSCFG interrupt line 26 status register</description>
            <addressOffset>0xE8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SPI2</name>
                <description>SPI2 interrupt request pending</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>SPI3</name>
                <description>SPI3 interrupt request pending</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSCFG_ITLINE27</name>
            <displayName>SYSCFG_ITLINE27</displayName>
            <description>SYSCFG interrupt line 27 status register</description>
            <addressOffset>0xEC</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>USART1</name>
                <description>USART1 interrupt request pending, combined with EXTI line 25</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSCFG_ITLINE28</name>
            <displayName>SYSCFG_ITLINE28</displayName>
            <description>SYSCFG interrupt line 28 status register</description>
            <addressOffset>0xF0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>USART2</name>
                <description>USART2 interrupt request pending (EXTI line 35)</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>LPUART2</name>
                <description>LPUART2 interrupt request pending (EXTI line 31)</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSCFG_ITLINE29</name>
            <displayName>SYSCFG_ITLINE29</displayName>
            <description>SYSCFG interrupt line 29 status register</description>
            <addressOffset>0xF4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>USART3</name>
                <description>USART3 interrupt request pending</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>LPUART1</name>
                <description>LPUART1 interrupt request pending (EXTI line 30)</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSCFG_ITLINE30</name>
            <displayName>SYSCFG_ITLINE30</displayName>
            <description>SYSCFG interrupt line 30 status register</description>
            <addressOffset>0xF8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>USART4</name>
                <description>USART4 interrupt request pending</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>LPUART3</name>
                <description>LPUART3 interrupt request pending (EXTI line 32)</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSCFG_ITLINE31</name>
            <displayName>SYSCFG_ITLINE31</displayName>
            <description>SYSCFG interrupt line 31 status register</description>
            <addressOffset>0xFC</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>RNG</name>
                <description>RNG interrupt request pending</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>AES</name>
                <description>AES interrupt request pending</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
