zuyih/platform-ststm32/misc/svd/STM32U083.svd
			<register>
			  <name>TIM2_CCMR1_ALTERNATE1</name>
			  <displayName>TIM2_CCMR1_ALTERNATE1</displayName>
			  <description>TIM2 capture/compare mode register 1</description>
			  <alternateRegister>TIM2_CCMR1</alternateRegister>
			  <addressOffset>0x18</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000000</resetValue>
			  <resetMask>0xFFFFFFFF</resetMask>
			  <fields>
				<field>
				  <name>CC1S</name>
				  <description>Capture/Compare 1 selection
	</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>2</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>CC1 channel is configured as output.</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>CC1 channel is configured as input, IC1 is mapped on TI1.</description>
					  <value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x2</name>
					  <description>CC1 channel is configured as input, IC1 is mapped on TI2.</description>
					  <value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x3</name>
					  <description>CC1 channel is configured as input, IC1 is mapped on TRC.</description>
					  <value>0x3</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>OC1FE</name>
				  <description>Output compare 1 fast enable
	</description>
				  <bitOffset>2</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>CC1 behaves normally depending on counter and CCR1 values even when the trigger is ON.</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>An active edge on the trigger input acts like a compare match on CC1 output.</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>OC1PE</name>
				  <description>Output compare 1 preload enable</description>
				  <bitOffset>3</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>Preload register on TIMx_CCR1 disabled.</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Preload register on TIMx_CCR1 enabled.</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>OC1M</name>
				  <description>OC1M[2:0]: Output compare 1 mode
	</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>3</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>Frozen - The comparison between the output compare register TIMx_CCR1 and the counter TIMx_CNT has no effect on the outputs.</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Set channel 1 to active level on match.</description>
					  <value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x2</name>
					  <description>Set channel 1 to inactive level on match.</description>
					  <value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x3</name>
					  <description>Toggle - OC1REF toggles when TIMx_CNT=TIMx_CCR1.</description>
					  <value>0x3</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x4</name>
					  <description>Force inactive level - OC1REF is forced low.</description>
					  <value>0x4</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x5</name>
					  <description>Force active level - OC1REF is forced high.</description>
					  <value>0x5</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x6</name>
					  <description>PWM mode 1 - In upcounting, channel 1 is active as long as TIMx_CNTless thanTIMx_CCR1 else inactive.</description>
					  <value>0x6</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x7</name>
					  <description>PWM mode 2 - In upcounting, channel 1 is inactive as long as TIMx_CNTless thanTIMx_CCR1 else active.</description>
					  <value>0x7</value>
					</enumeratedValue>					
				  </enumeratedValues>
				</field>
				<field>
				  <name>OC1CE</name>
				  <description>Output compare 1 clear enable</description>
				  <bitOffset>7</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>OC1Ref is not affected by the ETRF input</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>OC1Ref is cleared as soon as a High level is detected on ETRF input</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>CC2S</name>
				  <description>Capture/Compare 2 selection
	</description>
				  <bitOffset>8</bitOffset>
				  <bitWidth>2</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>CC2 channel is configured as output</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>CC2 channel is configured as input, IC2 is mapped on TI2</description>
					  <value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x2</name>
					  <description>CC2 channel is configured as input, IC2 is mapped on TI1</description>
					  <value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x3</name>
					  <description>CC2 channel is configured as input, IC2 is mapped on TRC.</description>
					  <value>0x3</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>OC2FE</name>
				  <description>Output compare 2 fast enable</description>
				  <bitOffset>10</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>OC2PE</name>
				  <description>Output compare 2 preload enable</description>
				  <bitOffset>11</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>OC2M</name>
				  <description>OC2M[2:0]: Output compare 2 mode
	</description>
				  <bitOffset>12</bitOffset>
				  <bitWidth>3</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>OC2CE</name>
				  <description>Output compare 2 clear enable</description>
				  <bitOffset>15</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>OC1M_1</name>
				  <description>OC1M[3]</description>
				  <bitOffset>16</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>OC2M_1</name>
				  <description>OC2M[3]</description>
				  <bitOffset>24</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
			  </fields>
			</register>
			<register>
			  <name>TIM2_CCMR2</name>
			  <displayName>TIM2_CCMR2</displayName>
			  <description>TIM2 capture/compare mode register 2</description>
			  <addressOffset>0x1C</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000000</resetValue>
			  <resetMask>0xFFFFFFFF</resetMask>
			  <fields>
				<field>
				  <name>CC3S</name>
				  <description>Capture/Compare 3 selection
	</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>2</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>CC3 channel is configured as output</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>CC3 channel is configured as input, IC3 is mapped on TI3</description>
					  <value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x2</name>
					  <description>CC3 channel is configured as input, IC3 is mapped on TI4</description>
					  <value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x3</name>
					  <description>CC3 channel is configured as input, IC3 is mapped on TRC.</description>
					  <value>0x3</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>IC3PSC</name>
				  <description>Input capture 3 prescaler</description>
				  <bitOffset>2</bitOffset>
				  <bitWidth>2</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>IC3F</name>
				  <description>Input capture 3 filter</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>4</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>CC4S</name>
				  <description>Capture/Compare 4 selection
	</description>
				  <bitOffset>8</bitOffset>
				  <bitWidth>2</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>CC4 channel is configured as output</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>CC4 channel is configured as input, IC4 is mapped on TI4</description>
					  <value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x2</name>
					  <description>CC4 channel is configured as input, IC4 is mapped on TI3</description>
					  <value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x3</name>
					  <description>CC4 channel is configured as input, IC4 is mapped on TRC.</description>
					  <value>0x3</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>IC4PSC</name>
				  <description>Input capture 4 prescaler</description>
				  <bitOffset>10</bitOffset>
				  <bitWidth>2</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>IC4F</name>
				  <description>Input capture 4 filter</description>
				  <bitOffset>12</bitOffset>
				  <bitWidth>4</bitWidth>
				  <access>read-write</access>
				</field>
			  </fields>
			</register>
			<register>
			  <name>TIM2_CCMR2_ALTERNATE1</name>
			  <displayName>TIM2_CCMR2_ALTERNATE1</displayName>
			  <description>TIM2 capture/compare mode register 2</description>
			  <alternateRegister>TIM2_CCMR2</alternateRegister>
			  <addressOffset>0x1C</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000000</resetValue>
			  <resetMask>0xFFFFFFFF</resetMask>
			  <fields>
				<field>
				  <name>CC3S</name>
				  <description>Capture/Compare 3 selection
	</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>2</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>CC3 channel is configured as output</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>CC3 channel is configured as input, IC3 is mapped on TI3</description>
					  <value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x2</name>
					  <description>CC3 channel is configured as input, IC3 is mapped on TI4</description>
					  <value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x3</name>
					  <description>CC3 channel is configured as input, IC3 is mapped on TRC.</description>
					  <value>0x3</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>OC3FE</name>
				  <description>Output compare 3 fast enable</description>
				  <bitOffset>2</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>OC3PE</name>
				  <description>Output compare 3 preload enable</description>
				  <bitOffset>3</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>OC3M</name>
				  <description>OC3M[2:0]: Output compare 3 mode
	</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>3</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>OC3CE</name>
				  <description>Output compare 3 clear enable</description>
				  <bitOffset>7</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>CC4S</name>
				  <description>Capture/Compare 4 selection
	</description>
				  <bitOffset>8</bitOffset>
				  <bitWidth>2</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>CC4 channel is configured as output</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>CC4 channel is configured as input, IC4 is mapped on TI4</description>
					  <value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x2</name>
					  <description>CC4 channel is configured as input, IC4 is mapped on TI3</description>
					  <value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x3</name>
					  <description>CC4 channel is configured as input, IC4 is mapped on TRC.</description>
					  <value>0x3</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>OC4FE</name>
				  <description>Output compare 4 fast enable</description>
				  <bitOffset>10</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>OC4PE</name>
				  <description>Output compare 4 preload enable</description>
				  <bitOffset>11</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>OC4M</name>
				  <description>OC4M[2:0]: Output compare 4 mode
	</description>
				  <bitOffset>12</bitOffset>
				  <bitWidth>3</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>OC4CE</name>
				  <description>Output compare 4 clear enable</description>
				  <bitOffset>15</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>OC3M_1</name>
				  <description>OC3M[3]</description>
				  <bitOffset>16</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>OC4M_1</name>
				  <description>OC4M[3]</description>
				  <bitOffset>24</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
			  </fields>
			</register>
			<register>
			  <name>TIM2_CCER</name>
			  <displayName>TIM2_CCER</displayName>
			  <description>TIM2 capture/compare enable register</description>
			  <addressOffset>0x20</addressOffset>
			  <size>16</size>
			  <access>read-write</access>
			  <resetValue>0x0000</resetValue>
			  <resetMask>0xFFFF</resetMask>
			  <fields>
				<field>
				  <name>CC1E</name>
				  <description>Capture/Compare 1 output enable.</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>Capture mode disabled / OC1 is not active</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Capture mode enabled / OC1 signal is output on the corresponding output pin</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>CC1P</name>
				  <description>Capture/Compare 1 output Polarity.</description>
				  <bitOffset>1</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>OC1 active high (output mode) / Edge sensitivity selection (input mode, see below)</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>OC1 active low (output mode) / Edge sensitivity selection (input mode, see below)</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>CC1NP</name>
				  <description>Capture/Compare 1 output Polarity.</description>
				  <bitOffset>3</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>CC2E</name>
				  <description>Capture/Compare 2 output enable.</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>CC2P</name>
				  <description>Capture/Compare 2 output Polarity.</description>
				  <bitOffset>5</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>CC2NP</name>
				  <description>Capture/Compare 2 output Polarity.</description>
				  <bitOffset>7</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>CC3E</name>
				  <description>Capture/Compare 3 output enable.</description>
				  <bitOffset>8</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>CC3P</name>
				  <description>Capture/Compare 3 output Polarity.</description>
				  <bitOffset>9</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>CC3NP</name>
				  <description>Capture/Compare 3 output Polarity.</description>
				  <bitOffset>11</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>CC4E</name>
				  <description>Capture/Compare 4 output enable.</description>
				  <bitOffset>12</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>CC4P</name>
				  <description>Capture/Compare 4 output Polarity.</description>
				  <bitOffset>13</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>CC4NP</name>
				  <description>Capture/Compare 4 output Polarity.</description>
				  <bitOffset>15</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
			  </fields>
			</register>
			<register>
			  <name>TIM2_CNT</name>
			  <displayName>TIM2_CNT</displayName>
			  <description>TIM2 counter</description>
			  <addressOffset>0x24</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000000</resetValue>
			  <resetMask>0xFFFFFFFF</resetMask>
			  <fields>
				<field>
				  <name>CNT</name>
				  <description>Least significant part of counter value</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>32</bitWidth>
				  <access>read-write</access>
				</field>
			  </fields>
			</register>
			<register>
			  <name>TIM2_CNT_ALTERNATE1</name>
			  <displayName>TIM2_CNT_ALTERNATE1</displayName>
			  <description>TIM2 counter</description>
			  <alternateRegister>TIM2_CNT</alternateRegister>
			  <addressOffset>0x24</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000000</resetValue>
			  <resetMask>0xFFFFFFFF</resetMask>
			  <fields>
				<field>
				  <name>CNT</name>
				  <description>Least significant part of counter value</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>31</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>UIFCPY</name>
				  <description>UIF Copy
	</description>
				  <bitOffset>31</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
			  </fields>
			</register>
			<register>
			  <name>TIM2_PSC</name>
			  <displayName>TIM2_PSC</displayName>
			  <description>TIM2 prescaler</description>
			  <addressOffset>0x28</addressOffset>
			  <size>16</size>
			  <access>read-write</access>
			  <resetValue>0x0000</resetValue>
			  <resetMask>0xFFFF</resetMask>
			  <fields>
				<field>
				  <name>PSC</name>
				  <description>Prescaler value
	</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>16</bitWidth>
				  <access>read-write</access>
				</field>
			  </fields>
			</register>
			<register>
			  <name>TIM2_ARR</name>
			  <displayName>TIM2_ARR</displayName>
			  <description>TIM2 auto-reload register</description>
			  <addressOffset>0x2C</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0xFFFFFFFF</resetValue>
			  <resetMask>0xFFFFFFFF</resetMask>
			  <fields>
				<field>
				  <name>ARR</name>
				  <description>Low Auto-reload value
	</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>32</bitWidth>
				  <access>read-write</access>
				</field>
			  </fields>
			</register>
			<register>
			  <name>TIM2_CCR1</name>
			  <displayName>TIM2_CCR1</displayName>
			  <description>TIM2 capture/compare register 1</description>
			  <addressOffset>0x34</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000000</resetValue>
			  <resetMask>0xFFFFFFFF</resetMask>
			  <fields>
				<field>
				  <name>CCR1</name>
				  <description>Low Capture/Compare 1 value
	</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>32</bitWidth>
				  <access>read-write</access>
				</field>
			  </fields>
			</register>
			<register>
			  <name>TIM2_CCR2</name>
			  <displayName>TIM2_CCR2</displayName>
			  <description>TIM2 capture/compare register 2</description>
			  <addressOffset>0x38</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000000</resetValue>
			  <resetMask>0xFFFFFFFF</resetMask>
			  <fields>
				<field>
				  <name>CCR2</name>
				  <description>Low Capture/Compare 2 value
	</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>32</bitWidth>
				  <access>read-write</access>
				</field>
			  </fields>
			</register>
			<register>
			  <name>TIM2_CCR3</name>
			  <displayName>TIM2_CCR3</displayName>
			  <description>TIM2 capture/compare register 3</description>
			  <addressOffset>0x3C</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000000</resetValue>
			  <resetMask>0xFFFFFFFF</resetMask>
			  <fields>
				<field>
				  <name>CCR3</name>
				  <description>Low Capture/Compare value
	</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>32</bitWidth>
				  <access>read-write</access>
				</field>
			  </fields>
			</register>
			<register>
			  <name>TIM2_CCR4</name>
			  <displayName>TIM2_CCR4</displayName>
			  <description>TIM2 capture/compare register 4</description>
			  <addressOffset>0x40</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000000</resetValue>
			  <resetMask>0xFFFFFFFF</resetMask>
			  <fields>
				<field>
				  <name>CCR4</name>
				  <description>Low Capture/Compare value
	</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>32</bitWidth>
				  <access>read-write</access>
				</field>
			  </fields>
			</register>
