zuyih/platform-ststm32/misc/svd/STM32U083.svd
			</registers>
	  </peripheral>	  
	  <peripheral>
			<name>TIM7</name>
			<description>TIM7 address block description</description>
			<groupName>TIM</groupName>
			<baseAddress>0x40001400</baseAddress>
			<addressBlock>
			  <offset>0x0</offset>
			  <size>0x30</size>
			  <usage>registers</usage>
			</addressBlock>
			<interrupt>
			  <name>TIM7_LPTIM2</name>
			  <description>TIM7 and LPTIM2 global interrupt (combined with EXTI line 30)</description>
			  <value>18</value>
			</interrupt>
			<registers>
			  <register>
				<name>TIM7_CR1</name>
				<displayName>TIM7_CR1</displayName>
				<description>TIM7 control register 1</description>
				<addressOffset>0x00</addressOffset>
				<size>16</size>
				<resetValue>0x0000</resetValue>
				<resetMask>0xFFFF</resetMask>
				<fields>
				  <field>
					<name>CEN</name>
					<description>Counter enable
	Note: Gated mode can work only if the CEN bit has been previously set by software. However trigger mode can set the CEN bit automatically by hardware. 
	CEN is cleared automatically in one-pulse mode, when an update event occurs.</description>
					<bitOffset>0</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
					<enumeratedValues>
					  <enumeratedValue>
						<name>B_0x0</name>
						<description>Counter disabled</description>
						<value>0x0</value>
					  </enumeratedValue>
					  <enumeratedValue>
						<name>B_0x1</name>
						<description>Counter enabled</description>
						<value>0x1</value>
					  </enumeratedValue>
					</enumeratedValues>
				  </field>
				  <field>
					<name>UDIS</name>
					<description>Update disable
	This bit is set and cleared by software to enable/disable UEV event generation.
	Counter overflow/underflow
	Setting the UG bit
	Update generation through the slave mode controller
	Buffered registers are then loaded with their preload values.</description>
					<bitOffset>1</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
					<enumeratedValues>
					  <enumeratedValue>
						<name>B_0x0</name>
						<description>UEV enabled. The Update (UEV) event is generated by one of the following events:</description>
						<value>0x0</value>
					  </enumeratedValue>
					  <enumeratedValue>
						<name>B_0x1</name>
						<description>UEV disabled. The Update event is not generated, shadow registers keep their value (ARR, PSC). However the counter and the prescaler are reinitialized if the UG bit is set or if a hardware reset is received from the slave mode controller.</description>
						<value>0x1</value>
					  </enumeratedValue>
					</enumeratedValues>
				  </field>
				  <field>
					<name>URS</name>
					<description>Update request source
	This bit is set and cleared by software to select the UEV event sources.
	Counter overflow/underflow
	Setting the UG bit
	Update generation through the slave mode controller</description>
					<bitOffset>2</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
					<enumeratedValues>
					  <enumeratedValue>
						<name>B_0x0</name>
						<description>Any of the following events generates an update interrupt or DMA request if enabled. These events can be:</description>
						<value>0x0</value>
					  </enumeratedValue>
					  <enumeratedValue>
						<name>B_0x1</name>
						<description>Only counter overflow/underflow generates an update interrupt or DMA request if enabled.</description>
						<value>0x1</value>
					  </enumeratedValue>
					</enumeratedValues>
				  </field>
				  <field>
					<name>OPM</name>
					<description>One-pulse mode</description>
					<bitOffset>3</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
					<enumeratedValues>
					  <enumeratedValue>
						<name>B_0x0</name>
						<description>Counter is not stopped at update event</description>
						<value>0x0</value>
					  </enumeratedValue>
					  <enumeratedValue>
						<name>B_0x1</name>
						<description>Counter stops counting at the next update event (clearing the CEN bit).</description>
						<value>0x1</value>
					  </enumeratedValue>
					</enumeratedValues>
				  </field>
				  <field>
					<name>ARPE</name>
					<description>Auto-reload preload enable</description>
					<bitOffset>7</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
					<enumeratedValues>
					  <enumeratedValue>
						<name>B_0x0</name>
						<description>TIMx_ARR register is not buffered.</description>
						<value>0x0</value>
					  </enumeratedValue>
					  <enumeratedValue>
						<name>B_0x1</name>
						<description>TIMx_ARR register is buffered.</description>
						<value>0x1</value>
					  </enumeratedValue>
					</enumeratedValues>
				  </field>
				  <field>
					<name>UIFREMAP</name>
					<description>UIF status bit remapping</description>
					<bitOffset>11</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
					<enumeratedValues>
					  <enumeratedValue>
						<name>B_0x0</name>
						<description>No remapping. UIF status bit is not copied to TIMx_CNT register bit 31.</description>
						<value>0x0</value>
					  </enumeratedValue>
					  <enumeratedValue>
						<name>B_0x1</name>
						<description>Remapping enabled. UIF status bit is copied to TIMx_CNT register bit 31.</description>
						<value>0x1</value>
					  </enumeratedValue>
					</enumeratedValues>
				  </field>
				</fields>
			  </register>
			  <register>
				<name>TIM7_CR2</name>
				<displayName>TIM7_CR2</displayName>
				<description>TIM7 control register 2</description>
				<addressOffset>0x04</addressOffset>
				<size>16</size>
				<resetValue>0x0000</resetValue>
				<resetMask>0xFFFF</resetMask>
				<fields>
				  <field>
					<name>MMS</name>
					<description>Master mode selection
	These bits are used to select the information to be sent in master mode to slave timers for synchronization (TRGO). The combination is as follows:
	When the Counter Enable signal is controlled by the trigger input, there is a delay on TRGO, except if the master/slave mode is selected (see the MSM bit description in the TIMx_SMCR register).
	Note: The clock of the slave timer or ADC must be enabled prior to receive events from the master timer, and must not be changed on-the-fly while triggers are received from the master timer.</description>
					<bitOffset>4</bitOffset>
					<bitWidth>3</bitWidth>
					<access>read-write</access>
					<enumeratedValues>
					  <enumeratedValue>
						<name>B_0x0</name>
						<description>Reset - the UG bit from the TIMx_EGR register is used as a trigger output (TRGO). If reset is generated by the trigger input (slave mode controller configured in reset mode) then the signal on TRGO is delayed compared to the actual reset.</description>
						<value>0x0</value>
					  </enumeratedValue>
					  <enumeratedValue>
						<name>B_0x1</name>
						<description>Enable - the Counter enable signal, CNT_EN, is used as a trigger output (TRGO). It is useful to start several timers at the same time or to control a window in which a slave timer is enabled. The Counter Enable signal is generated by a logic OR between CEN control bit and the trigger input when configured in gated mode.</description>
						<value>0x1</value>
					  </enumeratedValue>
					  <enumeratedValue>
						<name>B_0x2</name>
						<description>Update - The update event is selected as a trigger output (TRGO). For instance a master timer can then be used as a prescaler for a slave timer.</description>
						<value>0x2</value>
					  </enumeratedValue>
					</enumeratedValues>
				  </field>
				</fields>
			  </register>
			  <register>
				<name>TIM7_DIER</name>
				<displayName>TIM7_DIER</displayName>
				<description>TIM7 DMA/Interrupt enable register</description>
				<addressOffset>0x0C</addressOffset>
				<size>16</size>
				<resetValue>0x0000</resetValue>
				<resetMask>0xFFFF</resetMask>
				<fields>
				  <field>
					<name>UIE</name>
					<description>Update interrupt enable</description>
					<bitOffset>0</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
					<enumeratedValues>
					  <enumeratedValue>
						<name>B_0x0</name>
						<description>Update interrupt disabled.</description>
						<value>0x0</value>
					  </enumeratedValue>
					  <enumeratedValue>
						<name>B_0x1</name>
						<description>Update interrupt enabled.</description>
						<value>0x1</value>
					  </enumeratedValue>
					</enumeratedValues>
				  </field>
				  <field>
					<name>UDE</name>
					<description>Update DMA request enable</description>
					<bitOffset>8</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
					<enumeratedValues>
					  <enumeratedValue>
						<name>B_0x0</name>
						<description>Update DMA request disabled.</description>
						<value>0x0</value>
					  </enumeratedValue>
					  <enumeratedValue>
						<name>B_0x1</name>
						<description>Update DMA request enabled.</description>
						<value>0x1</value>
					  </enumeratedValue>
					</enumeratedValues>
				  </field>
				</fields>
			  </register>
			  <register>
				<name>TIM7_SR</name>
				<displayName>TIM7_SR</displayName>
				<description>TIM7 status register</description>
				<addressOffset>0x10</addressOffset>
				<size>16</size>
				<resetValue>0x0000</resetValue>
				<resetMask>0xFFFF</resetMask>
				<fields>
				  <field>
					<name>UIF</name>
					<description>Update interrupt flag
	This bit is set by hardware on an update event. It is cleared by software.
	At overflow or underflow regarding the repetition counter value and if UDIS = 0 in the TIMx_CR1 register.
	When CNT is reinitialized by software using the UG bit in the TIMx_EGR register, if URS1=10 and UDIS1=10 in the TIMx_CR1 register.</description>
					<bitOffset>0</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
					<enumeratedValues>
					  <enumeratedValue>
						<name>B_0x0</name>
						<description>No update occurred.</description>
						<value>0x0</value>
					  </enumeratedValue>
					  <enumeratedValue>
						<name>B_0x1</name>
						<description>Update interrupt pending. This bit is set by hardware when the registers are updated:</description>
						<value>0x1</value>
					  </enumeratedValue>
					</enumeratedValues>
				  </field>
				</fields>
			  </register>
			  <register>
				<name>TIM7_EGR</name>
				<displayName>TIM7_EGR</displayName>
				<description>TIM7 event generation register</description>
				<addressOffset>0x14</addressOffset>
				<size>16</size>
				<resetValue>0x0000</resetValue>
				<resetMask>0xFFFF</resetMask>
				<fields>
				  <field>
					<name>UG</name>
					<description>Update generation
	This bit can be set by software, it is automatically cleared by hardware.</description>
					<bitOffset>0</bitOffset>
					<bitWidth>1</bitWidth>
					<access>write-only</access>
					<enumeratedValues>
					  <enumeratedValue>
						<name>B_0x0</name>
						<description>No action.</description>
						<value>0x0</value>
					  </enumeratedValue>
					  <enumeratedValue>
						<name>B_0x1</name>
						<description>Re-initializes the timer counter and generates an update of the registers. Note that the prescaler counter is cleared too (but the prescaler ratio is not affected).</description>
						<value>0x1</value>
					  </enumeratedValue>
					</enumeratedValues>
				  </field>
				</fields>
			  </register>
			  <register>
				<name>TIM7_CNT</name>
				<displayName>TIM7_CNT</displayName>
				<description>TIM7 counter</description>
				<addressOffset>0x24</addressOffset>
				<size>0x20</size>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
				  <field>
					<name>CNT</name>
					<description>Counter value</description>
					<bitOffset>0</bitOffset>
					<bitWidth>16</bitWidth>
					<access>read-write</access>
				  </field>
				  <field>
					<name>UIFCPY</name>
					<description>UIF Copy
	This bit is a read-only copy of the UIF bit of the TIMx_ISR register. If the UIFREMAP bit in TIMx_CR1 is reset, bit 31 is reserved and read as 0.</description>
					<bitOffset>31</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-only</access>
				  </field>
				</fields>
			  </register>
			  <register>
				<name>TIM7_PSC</name>
				<displayName>TIM7_PSC</displayName>
				<description>TIM7 prescaler</description>
				<addressOffset>0x28</addressOffset>
				<size>16</size>
				<resetValue>0x0000</resetValue>
				<resetMask>0xFFFF</resetMask>
				<fields>
				  <field>
					<name>PSC</name>
					<description>Prescaler value
	The counter clock frequency CK_CNT is equal to f&lt;sub&gt;CK_PSC&lt;/sub&gt; / (PSC[15:0] + 1).
	PSC contains the value to be loaded into the active prescaler register at each update event.
	(including when the counter is cleared through UG bit of TIMx_EGR register or through trigger controller when configured in reset mode).</description>
					<bitOffset>0</bitOffset>
					<bitWidth>16</bitWidth>
					<access>read-write</access>
				  </field>
				</fields>
			  </register>
			  <register>
				<name>TIM7_ARR</name>
				<displayName>TIM7_ARR</displayName>
				<description>TIM7 auto-reload register</description>
				<addressOffset>0x2C</addressOffset>
				<size>16</size>
				<resetValue>0xFFFF</resetValue>
				<resetMask>0xFFFF</resetMask>
				<fields>
				  <field>
					<name>ARR</name>
					<description>Prescaler value
	ARR is the value to be loaded into the actual auto-reload register.
	Refer to Section123.3.1: Time-base unit on page1596 for more details about ARR update and behavior.
	The counter is blocked while the auto-reload value is null.</description>
					<bitOffset>0</bitOffset>
					<bitWidth>16</bitWidth>
					<access>read-write</access>
				  </field>
				</fields>
			  </register>
